/**
 * @author jhmoon
 */
define({
    InternalFormatString: {
        0: 'General',
        1: '0',
        2: '0.00',
        3: '#,##0',
        4: '#,##0.00',
        5: '"NT$"#,##0;-"NT$"#,##0',
        6: '"NT$"#,##0;[Red]-"NT$"#,##0',
        7: '"NT$"#,##0.00;-"NT$"#,##0.00',
        8: '"NT$"#,##0.00;[Red]-"NT$"#,##0.00',
        9: '0%',
        10: '0.00%',
        11: '0.00E+00',
        12: '# ?/?',
        13: '# ??/??',
        14: 'yyyy/m/d',
        15: 'd-mmm-yy',
        16: 'd-mmm',
        17: 'mmm-yy',
        18: 'h:mm AM/PM',
        19: 'h:mm:ss AM/PM',
        20: 'h:mm',
        21: 'h:mm:ss',
        22: 'yyyy/mm/d h:mm',
        23: '"US$"#,##0_);("US$"#,##0)',
        24: '"US$"#,##0_);[Red]("US$"#,##0)',
        25: '"US$"#,##0.00_);("US$"#,##0.00)',
        26: '"US$"#,##0.00_);[Red]("US$"#,##0.00)',
        27: '[$-404]e/m/d',
        28: '[$-404]e"年"m"月"d"日"',
        29: '[$-404]e"年"m"月"d"日"',
        30: 'm/d/yy',
        31: 'yyyy"年"m"月"d"日"',
        32: 'hh"時"mm"分"',
        33: 'hh"時"mm"分"ss"秒"',
        34: '上午/下午hh"時"mm"分"',
        35: '上午/下午hh"時"mm"分"ss"秒"',
        36: '[$-404]e/m/d',
        37: '#,##0;-#,##0',
        38: '#,##0;[Red]-#,##0',
        39: '#,##0.00;-#,##0.00',
        40: '#,##0.00;[Red]-#,##0.00',
        41: '_ * #,##0_ ;_ * -#,##0_ ;_ * "-"_ ;_ @_',
        42: '_ "$"* #,##0_ ;_ "$"* -#,##0_ ;_ "$"* "-"_ ;_ @_',
        43: '_ * #,##0.00_ ;_ * -#,##0.00_ ;_ * "-"??_ ;_ @_',
        44: '_ "$"* #,##0.00_ ;_ "$"* -#,##0.00_ ;_ "$"* "-"??_ ;_ @_',
        45: 'mm:ss',
        46: '[h]:mm:ss',
        47: 'mm:ss.0',
        48: '##0.0E+0',
        49: '@',
        50: '[$-404]e/m/d',
        51: '[$-404]e"年"m"月"d"日"',
        52: '上午/下午hh"時"mm"分"',
        53: '上午/下午hh"時"mm"分"ss"秒"',
        54: '[$-404]e"年"m"月"d"日"',
        55: '上午/下午hh"時"mm"分"',
        56: '上午/下午hh"時"mm"分"ss"秒"',
        57: '[$-404]e/m/d',
        58: '[$-404]e"年"m"月"d"日"',
        59: '0',
        60: '0.00'
    },

    DefaultLocationFormat: {
        number  :   [164, '0.00_);[Red](0.00)'],
        currency:   [164, '$#,##0.00_);[Red]($#,##0.00)'],
        account :   [44 , '_ "$"* #,##0.00_ ;_ "$"* -#,##0.00_ ;_ "$"* "-"??_ ;_ @_'],
        date    :   [14 , 'yyyy/m/d'],
        longDate:   [164, '[$-F800]dddd, mmmm dd, yyyy'],
        time    :   [164, '[$-F400]h:mm:ss AM/PM'],
        percentage: [10 , '0.00%'],
        fraction:   [12 , '# ?/?'],
        scientific: [11 , '0.00E+00'],
        comma   :   [43 , '_ * #,##0.00_ ;_ * -#,##0.00_ ;_ * "-"??_ ;_ @_']
    },

    LocaleName: "zh_tw",

    GeneralName: "G/通用格式", // 숫자 일반 서식

    DefaultDatePatterns: [
        "yyyy/m/d h:mm:ss AM/PM", // full date time
        "yyyy/m/d", // date
        "h:mm:ss AM/PM" // time (한국 미국 대만 3나라만 ap가 존재)
    ],

    // F800, F400
    SystemDateTimePatterns: [
        'yyyy"年"m"月"d"日"',
        'AM/PM hh:mm:ss'
    ],

    // 1000 단위 기호 패턴
    ThousandsSeparatorPatterns: [
        // 1000 단위 기호 패턴
        '#,##0.00_);[Red](#,##0.00)',
        '#,##0.00_);(#,##0.00)',
        '#,##0.00;[Red]#,##0.00',
        '#,##0.00_ ',
        '#,##0.00_ ;[Red]-#,##0.00 '
    ],

    // 음수 패턴
    NegativePatterns: [
        '0.00_);[Red](0.00)',
        '0.00_);(0.00)',
        '0.00;[Red]0.00',
        '0.00_ ',
        '0.00_ ;[Red]-0.00 '
    ],

    // default 소수 자릿수 2
    CurrencyPatterns: [
        '$#,##0.00_);[Red]($#,##0.00)',
        '$#,##0.00_);($#,##0.00)',
        '$#,##0.00;[Red]$#,##0.00',
        '$#,##0.00',
        '$#,##0.00;[Red]-$#,##0.00'
    ],

    DatePatterns: [
        "yyyy/m/d",
        "[$-F800]dddd, mmmm dd, yyyy",
        'yyyy"年"m"月"d"日";@',
        'm"月"d"日";@',
        '[DBNum1][$-404]yyyy"年"m"月"d"日";@',
        '[DBNum1][$-404]m"月"d"日";@',
        "[$-404]aaaa;@",
        "[$-404]aaa;@",
        "yyyy/m/d;@",
        "yyyy/m/d h:mm;@",
        "[$-409]yyyy/m/d h:mm AM/PM;@",
        "m/d;@",
        "m/d/yy;@",
        "mm/dd/yy;@",
        "[$-409]d-mmm;@",
        "[$-409]d-mmm-yy;@",
        "[$-409]mmmmm;@",
        "[$-409]mmmmm-yy;@"
    ],

    TimePatterns: [
        "[$-F400]h:mm:ss AM/PM",
        "h:mm;@",
        "[$-409]h:mm AM/PM;@",
        "h:mm:ss;@",
        "[$-409]h:mm:ss AM/PM;@",
        "[$-409]yyyy/m/d h:mm AM/PM;@",
        "yyyy/m/d h:mm;@",
        'h"時"mm"分";@',
        'h"時"mm"分"ss"秒";@',
        'AM/PMh"時"mm"分";@',
        'AM/PMh"時"mm"分"ss"秒";@'
    ],

    SpecialPatterns: [
        '000',
        '0000000-0',
        '[<=9999999]###-####;(0#) ###-####',
        '[<=99999999]####-####;(0#) ####-####',
        '[>99999999]0000-000-000;000-000-000',
        '[DBNum1][$-404]General',
        '[DBNum2][$-404]General'
    ],

    // TODO 임의 번역 리소스, 확인 필요
    SpecialTypes: [
        '郵遞區號', // 우체구호
        '郵政劃撥帳號', // 우정획발장호
        '一般電話號碼(7位數)', // 일반전화호마(7위수)
        '一般電話號碼(8位數)', // 일반전화호마(8위수)
        '行動電話﹑呯叫器號碼', // 행동전화, 평규기호마
        '一萬二千三百四十五',
        '壹萬貳仟蔘佰肆拾伍'
    ],

    CustomPatterns: [
        'General',
        '0',
        '0.00',
        '#,##0',
        '#,##0.00',
        '_ * #,##0_ ;_ * -#,##0_ ;_ * "-"_ ;_ @_',
        '_ * #,##0.00_ ;_ * -#,##0.00_ ;_ * "-"??_ ;_ @_',
        '_ "$"* #,##0_ ;_ "$"* -#,##0_ ;_ "$"* "-"_ ;_ @_',
        '_ "$"* #,##0.00_ ;_ "$"* -#,##0.00_ ;_ "$"* "-"??_ ;_ @_',
        '#,##0;-#,##0',
        '#,##0;[Red]-#,##0',
        '#,##0.00;-#,##0.00',
        '#,##0.00;[Red]-#,##0.00',
        '$#,##0;¥-#,##0',
        '$#,##0;[Red]¥-#,##0',
        '$#,##0.00;¥-#,##0.00',
        '$#,##0.00;[Red]¥-#,##0.00',
        '0%',
        '0.00%',
        '0.00E+00',
        '##0.0E+0',
        '# ?/?',
        '# ??/??',
        '$#,##0_);($#,##0)',
        '$#,##0_);[Red]($#,##0)',
        '$#,##0.00_);($#,##0.00)',
        '$#,##0.00_);[Red]($#,##0.00)',
        '[$-404]e/m/d',
        '[$-404]e"年"m"月"d"日"',
        'yyyy"年"m"月"',
        'm"月"d"日"',
        'yyyy/m/d',
        'yyyy"年"m"月"d"日"',
        'm/d/yy',
        'd-mmm-yy',
        'd-mmm',
        'mmm-yy',
        'hh:mm AM/PM',
        'hh:mm:ss AM/PM',
        'hh:mm',
        'hh:mm:ss',
        'hh"时"mm"分"',
        'hh"时"mm"分"ss"秒"',
        'AM/PMh"时"mm"分"',
        'AM/PMh"时"mm"分"ss"秒"',
        'yyyy/m/d h:mm',
        'mm:ss',
        'mm:ss.0',
        '@',
        '[h]:mm:ss'
    ],

    ColorElements: ['黑色', '蓝色', '蓝绿色', '绿色', '洋红', '红色', '白色', '黄色'],

    // 숫자 매핑, 자릿수 매핑, 0무시, 1무시
    NumDB: ["\u25cb一二三四五六七八九", "十百千万億兆", "Y", "Y", "零壹\u8D30\u53C1肆伍\u9646柒捌玖", "拾佰仟万\u4EBF兆", "Y", "N", "", "十百千万億兆", "Y", "Y", "", "", "N", "N"],

    AmPmMarkers: ["A", "P", "上午", "下午"],

    Eras: ["BC", "AD"],

    YearTables: ["0"],

    CharSeperator: ["!"],

    DateElements: [
        "y", // year symbols
        "m", // month symbols
        "d", // day symbols
        "/", // date seperator
        "h", // hour symbol
        "m", // minute symbol
        "s", // second symbol
        ":"  // time seperator
    ],

    NumberElements: [
        ".", // decimal separator
        ",", // group (thousands) separator
        "," // function param separator
    ],

    // local currency symbol, currency fraction digit count, head position ? tail position ?
    CurrencyElements: [
        "NT$", // local currency symbol
        "2", // currency fraction digit count
        "t" // head position ? , tail position ?
    ],

    DaysLocale: [
        ["週日", "星期日"],
        ["週一", "星期一"],
        ["週二", "星期二"],
        ["週三", "星期三"],
        ["週四", "星期四"],
        ["週五", "星期五"],
        ["週六", "星期六"]
    ],

    MonthsLocale: [
        ["1", "一月", "一月"],
        ["2", "二月", "二月"],
        ["3", "三月", "三月"],
        ["4", "四月", "四月"],
        ["5", "五月", "五月"],
        ["6", "六月", "六月"],
        ["7", "七月", "七月"],
        ["8", "八月", "八月"],
        ["9", "九月", "九月"],
        ["10", "十月", "十月"],
        ["11", "十一月", "十一月"],
        ["12", "十二月", "十二月"]
    ]
});