/**
 * @author jhmoon
 */
define({
    InternalFormatString: {
        0: 'General',
        1: '0',
        2: '0.00',
        3: '#,##0',
        4: '#,##0.00',
        5: '"¥"#,##0;-"¥"#,##0',
        6: '"¥"#,##0;[Red]-"¥"#,##0',
        7: '"¥"#,##0.00;-"¥"#,##0.00',
        8: '"¥"#,##0.00;[Red]-"¥"#,##0.00',
        9: '0%',
        10: '0.00%',
        11: '0.00E+00',
        12: '# ?/?',
        13: '# ??/??',
        14: 'yyyy-mm-dd',
        15: 'dd-mmm-yy',
        16: 'dd-mmm',
        17: 'mmm-yy',
        18: 'h:mm AM/PM',
        19: 'h:mm:ss AM/PM',
        20: 'h:mm',
        21: 'h:mm:ss',
        22: 'd/mm/yyyy h:mm',
        23: '$#,##0_);($#,##0)',
        24: '$#,##0_);[Red]($#,##0)',
        25: '$#,##0.00_);($#,##0.00)',
        26: '$#,##0.00_);[Red]($#,##0.00)',
        27: '[$-411]ge\.m/d',
        28: '[$-411]ggge"年"m"月"d"日"',
        29: '[$-411]ggge"年"m"月"d"日"',
        30: 'm/d/yy',
        31: 'yyyy"年"m"月"d"日"',
        32: 'h"時"mm"分"',
        33: 'h"時"mm"分"ss"秒"',
        34: 'yyyy"年"m"月"',
        35: 'm"月"d"日"',
        36: '[$-411]ge\.m/d',
        37: '#,##0;-#,##0',
        38: '#,##0;[Red]-#,##0',
        39: '#,##0.00;-#,##0.00',
        40: '#,##0.00;[Red]-#,##0.00',
        41: '_ * #,##0_ ;_ * -#,##0_ ;_ * "-"_ ;_ @_',
        42: '_ "¥"* #,##0_ ;_ "¥"* -#,##0_ ;_ "¥"* "-"_ ;_ @_',
        43: '_ * #,##0.00_ ;_ * -#,##0.00_ ;_ * "-"??_ ;_ @_',
        44: '_ "¥"* #,##0.00_ ;_ "¥"* -#,##0.00_ ;_ "¥"* "-"??_ ;_ @_',
        45: 'mm:ss',
        46: '[h]:mm:ss',
        47: 'mm:ss.0',
        48: '##0.0E+0',
        49: '@',
        50: '[$-411]ge\.m/d',
        51: '[$-411]ggge"年"m"月"d"日"',
        52: 'yyyy"年"m"月"',
        53: 'm"月"d"日"',
        54: '[$-411]ggge"年"m"月"d"日"',
        55: 'yyyy"年"m"月"',
        56: 'm"月"d"日"',
        57: '[$-411]ge\.m/d',
        58: '[$-411]ggge"年"m"月"d"日"',
        59: '0',
        60: '0.00'
    },

    DefaultLocationFormat: {
        number  :   [164, '0_);[Red](0)'],
        currency:   [164, '¥#,##0_);[Red](¥#,##0)'],
        account :   [42 , '_ "¥"* #,##0_ ;_ "¥"* -#,##0_ ;_ "¥"* "-"_ ;_ @_'],
        date    :   [14 , 'yyyy/mm/dd'],
        longDate:   [164, '[$-F800]dddd, mmmm dd, yyyy'],
        time    :   [164, '[$-F400]h:mm:ss AM/PM'],
        percentage: [9  , '0%'],
        fraction:   [12 , '# ?/?'],
        scientific: [164, '0.E+00'],
        comma   :   [41 , '_ * #,##0_ ;_ * -#,##0_ ;_ * "-"_ ;_ @_']
    },

    LocaleName: "ja",

    // 입력 패턴 날짜 변환 서식
    DateConversionFormat: [
        'dd-mmm', // m-d, mmm-d, mmmm-d, dd-mmm, dd-mmmm, mmmmm-d(x), dd-mmmmm(x), yyyy-mm(x), yy-mm(x), dd-m(x)
        'mmm-yy', // m-yy(yy),
        'yyyy-mm-dd',
        'yyyy"年" mm"月" dd"日"',
        'yyyy"年" mm"月" dd"日"',
        'yyyy-mm-dd h:mm', // yyyy-mm-dd h:mm AM/PM, yyyy-mm-dd h:mm:ss AM/PM
        'mm"月" dd"日"' // m-d
    ],

    GeneralName: "G/標準", // 숫자 일반 서식

    DefaultDatePatterns: [
        "yyyy/mm/dd h:mm:ss AM/PM", // full date time
        "yyyy/mm/dd", // date
        "h:mm:ss" // time
    ],

    // F800, F400
    SystemDateTimePatterns: [
        'yyyy"年"m"月"d"日"',
        'h:mm:ss',
    ],

    // 1000 단위 기호 패턴
    ThousandsSeparatorPatterns: [
        // 1000 단위 기호 패턴
        '#,##0_);[Red](#,##0)',
        '#,##0_);(#,##0)',
        '#,##0;[Red]#,##0',
        '#,##0_ ',
        '#,##0_ ;[Red]-#,##0 ',
        '#,##0_ ;△#,##0 ',
        '#,##0_ ;▲#,##0 '
    ],

    // 음수 패턴
    NegativePatterns: [
        '0_);[Red](0)',
        '0_);(0)',
        '0;[Red]0',
        '0_ ',
        '0_ ;[Red]-0 ',
        '0;"△ "0',
        '0;"▲ "0'
    ],

    // default 소수 자릿수 2
    CurrencyPatterns: [
        '¥#,##0_);[Red](¥#,##0)',
        '¥#,##0_);(¥#,##0)',
        '¥#,##0;[Red]¥#,##0',
        '¥#,##0;¥-#,##0',
        '¥#,##0;[Red]¥-#,##0'
    ],

    DatePatterns: [
        'yyyy/m/dd',
        '[$-F800]dddd, mmmm dd, yyyy',
        'yyyy"年"m"月"d"日";@',
        'yyyy"年"m"月";@',
        'm"月"d"日";@',
        'yyyy/m/d;@',
        '[$-409]yyyy/m/d h:mm AM/PM;@',
        'yyyy/m/d h:mm;@',
        'm/d;@',
        'm/d/yy;@',
        'mm/dd/yy;@',
        '[$-409]d-mmm;@',
        '[$-409]d-mmm-yy;@',
        '[$-409]dd-mmm-yy;@',
        '[$-409]mmm-yy;@',
        '[$-409]mmmm-yy;@',
        '[$-409]mmmmm;@',
        '[$-409]mmmmm-yy;@'
    ],

    TimePatterns: [
        '[$-F400]h:mm:ss AM/PM',
        'h:mm;@',
        '[$-409]h:mm AM/PM;@',
        'h:mm:ss;@',
        '[$-409]h:mm:ss AM/PM;@',
        '[$-409]yyyy/m/d h:mm AM/PM;@',
        'yyyy/m/d h:mm;@',
        'h"時"mm"分";@',
        'h"時"mm"分"ss"秒";@'
    ],

    SpecialPatterns: [
        '[<=999]000;[<=9999]000-00;000-0000',
        '[<=99999999]####-####;(00) ####-####',
        '"△" #,##0;"▲" #,##0',
        '[DBNum1][$-411]General',
        '[DBNum2][$-411]General',
        '[DBNum3][$-411]0',
        '[DBNum3][$-411]#,##0'
    ],

    SpecialTypes: [
        '郵便番号',
        '電話番号(東京)',
        '正負記号(＋ = △ ; － = ▲)',
        '渶数字 (十二万三千四百)',
        '大字 (壱拾弐萬參阡四百)',
        '全角 （１２３４５）',
        '全角 桁区切り(１２,３４５)'
    ],

    CustomPatterns: [
        'General',
        '0',
        '0.00',
        '#,##0',
        '#,##0.00',
        '_ * #,##0_ ;_ * -#,##0_ ;_ * "-"_ ;_ @_',
        '_ * #,##0.00_ ;_ * -#,##0.00_ ;_ * "-"??_ ;_ @_',
        '_ "¥"* #,##0_ ;_ "¥"* -#,##0_ ;_ "¥"* "-"_ ;_ @_',
        '_ "¥"* #,##0.00_ ;_ "¥"* -#,##0.00_ ;_ "¥"* "-"??_ ;_ @_',
        '#,##0;-#,##0',
        '#,##0;[Red]-#,##0',
        '#,##0.00;-#,##0.00',
        '#,##0.00;[Red]-#,##0.00',
        '¥#,##0;¥-#,##0',
        '¥#,##0;[Red]¥-#,##0',
        '¥#,##0.00;¥-#,##0.00',
        '¥#,##0.00;[Red]¥-#,##0.00',
        '0%',
        '0.00%',
        '0.00E+00',
        '##0.0E+0',
        '# ?/?',
        '# ??/??',
        '$#,##0_);($#,##0)',
        '$#,##0_);[Red]($#,##0)',
        '$#,##0.00_);($#,##0.00)',
        '$#,##0.00_);[Red]($#,##0.00)',
        '[$-411]ge.m.d',
        '[$-411]ggge"年"m"月"d"日"',
        'yyyy/m/d',
        'yyyy"年"m"月"d"日"',
        'yyyy"年"m"月"',
        'm"月"d"日"',
        'm/d/yy',
        'd-mmm-yy',
        'd-mmm',
        'mmm-yy',
        'h:mm AM/PM',
        'h:mm:ss AM/PM',
        'h:mm',
        'h:mm:ss',
        'h"時"mm"分"',
        'h"時"mm"分"ss"秒"',
        'yyyy/mm/dd h:mm',
        'mm:ss',
        'mm:ss.0',
        '@',
        '[h]:mm:ss',
    ],

    ColorElements: ["\u9ed2", "\u9757", "水", "\u7dd1", "紫", "赤", "白", "\u9ec4"],

    // 숫자 매핑, 자릿수 매핑, 0무시, 1무시
    NumDB: ["\u3007一二三四五六七八九", "十百千万億兆", "Y", "Y", "\u3007\u58f1\u5f10\u53c2四伍六七八九", "拾百阡萬億兆", "Y", "N", "０１２３４５６７８９", "", "N", "N", "", "", "N", "N"],

    AmPmMarkers: ["\u5348\u524d", "\u5348\u5f8c", "\u5348\u524d", "\u5348\u5f8c"],

    Eras: ["BC", "AD"],

    YearTables: [
        "4", // header , itemcount
        "-11687", "4595", "9856", "32516", // 1900
        "-13148", "3133", "8394", "31054", // 1904
        "M", "T", "S", "H", // shortest
        "明", "大", "昭", "平", // short
        "明治", "大正", "昭和", "平成" // normal
    ],

    CharSeperator: ["!"],

    DateElements: [
        "y", // year symbols
        "m", // month symbols
        "d", // day symbols
        "/", // date seperator
        "h", // hour symbol
        "m", // minute symbol
        "s", // second symbol
        ":" // time seperator
    ],

    // local currency symbol, currency fraction digit count, head position ? tail position ?
    CurrencyElements: [
        "¥", // local currency symbol
        "0", // currency fraction digit count
        "t" // head position ? , tail position ?
    ],

    DaysLocale: [
        ["日", "日曜日"],
        ["月", "月曜日"],
        ["火", "火曜日"],
        ["水", "水曜日"],
        ["木", "木曜日"],
        ["金", "金曜日"],
        ["土", "土曜日"]
    ],

    MonthsLocale: [
        ["1", "1", "1月"],
        ["2", "2", "2月"],
        ["3", "3", "3月"],
        ["4", "4", "4月"],
        ["5", "5", "5月"],
        ["6", "6", "6月"],
        ["7", "7", "7月"],
        ["8", "8", "8月"],
        ["9", "9", "9月"],
        ["10", "10", "10月"],
        ["11", "11", "11月"],
        ["12", "12", "12月"]
    ]
});