/**
 * @author jhmoon
 */
define({
    InternalFormatString: {
        0: 'General',
        1: '0',
        2: '0.00',
        3: '#,##0',
        4: '#,##0.00',
        5: '#,##0 "лв.";-#,##0 "лв."',
        6: '#,##0 "лв.";[Red]-#,##0 "лв."',
        7: '#,##0.00 "лв.";-#,##0.00 "лв."',
        8: '#,##0.00 "лв.";[Red]-#,##0.00 "лв."',
        9: '0%',
        10: '0.00%',
        11: '0.00E+00',
        12: '# ?/?',
        13: '# ??/??',
        14: 'd/m/yyyy',
        15: 'd/mmm/yy',
        16: 'd/mmm',
        17: 'mmm/yy',
        18: 'h:mm AM/PM',
        19: 'h:mm:ss AM/PM',
        20: 'h:mm',
        21: 'h:mm:ss',
        22: 'd/m/yyyy h:mm',
        23: 'General',
        24: 'General',
        25: 'General',
        26: 'General',
        27: 'd/m/yyyy',
        28: 'd/m/yyyy',
        29: 'd/m/yyyy',
        30: 'd/m/yyyy',
        31: 'd/m/yyyy',
        32: 'h:mm:ss',
        33: 'h:mm:ss',
        34: 'h:mm:ss',
        35: 'h:mm:ss',
        36: 'd/m/yyyy',
        37: '=#,##0 _л_в_.;-#,##0 _л_в_.',
        38: '=#,##0 _л_в_.;[Red]-#,##0 _л_в_.',
        39: '=#,##0.00 _л_в_.;-#,##0.00 _л_в_.',
        40: '=#,##0.00 _л_в_.;[Red]-#,##0.00 _л_в_.',
        41: '=_-* #,##0 _л_в_._-;-* #,##0 _л_в_._-;_-* "-" _л_в_._-;_-@_-',
        42: '=_-* #,##0 "лв."_-;-* #,##0 "лв."_-;_-* "-" "лв."_-;_-@_-',
        43: '=_-* #,##0.00 _л_в_._-;-* #,##0.00 _л_в_._-;_-* "-"?? _л_в_._-;_-@_-',
        44: '=_-* #,##0.00 "лв."_-;-* #,##0.00 "лв."_-;_-* "-"?? "лв."_-;_-@_-',
        45: 'mm:ss',
        46: '[h]:mm:ss',
        47: 'mm:ss.0',
        48: '##0.0E+0',
        49: '@',
        50: 'd/m/yyyy',
        51: 'd/m/yyyy',
        52: 'd/m/yyyy',
        53: 'd/m/yyyy',
        54: 'd/m/yyyy',
        55: 'd/m/yyyy',
        56: 'd/m/yyyy',
        57: 'd/m/yyyy',
        58: 'd/m/yyyy',
        59: '0',
        60: '0.00'
    },

    LocaleName: "bg",

    // local currency symbol, currency fraction digit count, head position ? tail position ?
    CurrencyElements: ['лв', '2', 't'],

    GeneralName: "General", // 숫자 일반 서식

    DefaultDatePatterns: [
        'mm/dd/yyyy h:mm:ss', // full date time
        'mm/dd/yyyy', // date
        'h:mm:ss' // time
    ],

    DatePatterns: [
        'd/m/yyyy',
        '[$-F800]dddd, mmmm dd, yyyy',
        'dd.m.yyyy "г.";@',
        'd.m.yyyy "г.";@',
        'dd.mm.yyyy "г.";@',
        'yyyy-mm-dd;@',
        '[$-402]dd mmmm yyyy "г.";@',
        '[$-402]dddd, dd mmmm yyyy "г.";@'
    ],

    TimePatterns: [
        '[$-F400]h:mm:ss AM/PM',
        'hh:mm:ss;@',
        'h:mm:ss;@'
    ],

    SpecialPatterns: [
        '00000',
        '00000-0000',
        '[<=9999999]###-####;(###) ###-####',
        '000-00-0000'
    ],

    ColorElements: ['Черно', 'Синьо', 'Циан', 'Зелено', 'Магента', 'Червено', 'Бяло', 'Жълто'],

    DaysLocale: [
        ["нед", "неделя"],
        ["пон", "понеделник"],
        ["вто", "вторник"],
        ["сря", "сряда"],
        ["чет", "четвъртък"],
        ["пет", "петък"],
        ["съб", "събота"]
    ],

    MonthsLocale: [
        ["Я", "Яну", "Януари"],
        ["Ф", "Фев", "Февруари"],
        ["М", "Мар", "Март"],
        ["A", "Апр", "Април"],
        ["M", "Май", "Май"],
        ["Ю", "Юни", "Юни"],
        ["Ю", "Юли", "Юли"],
        ["A", "Авг", "Август"],
        ["С", "Сеп", "Септември"],
        ["O", "Окт", "Октомври"],
        ["Н", "Ное", "Ноември"],
        ["Д", "Дек", "Декември"]
    ],

    FormulaElements: [
        ";",  // function param separator
        "\\", // array column separator
        ";",  // union operator
        ";"   // array row separator
    ]

});